StoveSim/simulations/case_30/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         localEuler;
}

gradSchemes
{
    default        cellLimited Gauss linear 1; 
}


laplacianSchemes
{
    default         Gauss linear orthogonal;
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    default         orthogonal;
}

divSchemes
{
    default         none;
    div(phi,U)      bounded Gauss limitedLinearV 1; //boundedness enhanced
	div(phi,K)      Gauss limitedLinear 1;
    div(phid,p)     Gauss limitedLinear 1;
    div(phi,epsilon) Gauss limitedLinear 1;
    div(phi,k) Gauss limitedLinear 1;
    div(((rho*nuEff)*dev2(T(grad(U))))) Gauss linear;
    div(phi,Yi_h)   Gauss limitedLinear01 1; 
	/*{	
		O2 limitedLinear01 1;
        CH4 limitedLinear01 1; 
        N2 limitedLinear01 1; 
        H2O limitedLinear01 1; 
        CO2 limitedLinear01 1; 
        h limitedLinear 1;
	}*\
}
// ************************************************************************* //
